# Como realizar una copia de seguridad de un router

## Montar un servidor TFTP

El protocolo TFTP o Trivial file transfer Protocol (Protocolo de transferencia de archivos trivial) nos permite enviar y recibir archivos a un servidor. 
Para hacer la practica, montamos un servidor TFTP y le damos una Ip por la que pueda acceder al router.

## Realizar backup del router

Ver el contenido de la memoria flash.

``` cisco ios
Router>enable
Router#show flash

System flash directory:
File  Length   Name/status
  3   33591768 2800nm-advipservicesk9-mz.151-4.M4.bin
  2   28282    sigdef-category.xml
  1   227537   sigdef-default.xml
[33847587 bytes used, 221896413 available, 255744000 total]
249856K bytes of processor board System flash (Read/Write)
```

Ahora comprobamos que tenemos conexiÃ³n al servidor tftp y realizamos la transferencia de ficheros, 
indicando el fichero a trasferir, el destino y el nombre del fichero en el destino.

``` cisco ios
Router#ping 192.168.0.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.0.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms

Router#copy flash: tftp:
Source filename []? 2800nm-advipservicesk9-mz.151-4.M4.bin
Address or name of remote host []? 192.168.0.2
Destination filename [2800nm-advipservicesk9-mz.151-4.M4.bin]? routerios

Writing 2800nm-advipservicesk9-mz.151-4.M4.bin...!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
[OK - 33591768 bytes]

33591768 bytes copied in 0.589 secs (5988110 bytes/sec)
```

## Ahora borramos los ficheros del router

Borramos el fichero .bin de la falsh del router

``` cisco ios
Router#delete flash:
Delete filename []??
Delete flash:/?? [confirm]
%Error deleting flash:/? (No such file or directory)

Router#delete flash:2800nm-advipservicesk9-mz.151-4.M4.bin
Delete filename [2800nm-advipservicesk9-mz.151-4.M4.bin]? routerios
Delete flash:/2800nm-advipservicesk9-mz.151-4.M4.bin? [confirm]routerios
```

El router sigue funcionando, porque IOS sigue ejecutandose en la RAM.

## Reiniciamos el router

Ahora reiniciamos el router

``` cisco ios
Router#reload
System configuration has been modified. Save? [yes/no]:n
Proceed with reload? [confirm]
```

Y el router en modo ROMMON.

``` cisco ios
System Bootstrap, Version 12.4(1r) [hqluong 1r], RELEASE SOFTWARE (fc1)
Copyright (c) 2005 by cisco Systems, Inc.

Initializing memory for ECC
..
C2800 processor with 524288 Kbytes of main memory
Main memory is configured to 64 bit mode with ECC enabled

Readonly ROMMON initialized

Boot process failed...

The system is unable to boot automatically.  The BOOT
environment variable needs to be set to a bootable
image.
rommon 1 > 
```

## Recuperar la informaciÃ³n

Para recuperar el router, primero tenemso que conigurar el modo ROMMON.

``` cisco ios
tftpdnld
```

Configuramos las variables que se asignaran al primer interface del router.

``` cisco ios
ROMMON 2>IP_ADDRESS=192.168.0.1
ROMMON 3>IP_SUBNET_MASK=255.255.255.0
ROMMON 4>DEFAULT_GATEWAY=192.168.0.2
ROMMON 5>TFTP_SERVER=192.168.0.2
ROMMON 6>TFTP_FILE=routerios
```

Realizamos la recuperaciÃ³n de fichero que contiene la bios.

``` cisco ios
rommon 7 > tftpdnld

          IP_ADDRESS: 192.168.0.1
      IP_SUBNET_MASK: 255.255.255.0
     DEFAULT_GATEWAY: 192.168.0.2
         TFTP_SERVER: 192.168.0.2
           TFTP_FILE: routerios
Invoke this command for disaster recovery only.
WARNING: all existing data in all partitions on flash will be lost!

Do you wish to continue? y/n:  [n]:  y
```

Reiniciamos el router

``` cisco ios
rommon 8 > reset
```