# Configurar NAT dinamico con router CISCO

<!-- Cuidado que falta 

Router2(config)# ip default-gateway 212.100.100.2
Router2(config)# no ip routing

https://ipcisco.com/lesson/pat-configuration-with-packet-tracer-2/ -->

Para configurar un router CISCO con NAT dinamico.

## Creamo una red para la practica

Creamos dos redes unidas por un Router

![Nat estatico](Imagenes/NatEstatico.png)

## Configuramos el router

Configuramos el primer router

``` cisco ios
Router>enable
Router#configure terminal 
%SYS-5-CONFIG_I: Configured from console by console
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#
```

De igual forma configuramos el otro interface.

``` cisco ios
Router>enable
Router#configure terminal 
%SYS-5-CONFIG_I: Configured from console by console
Router(config)#interface fastEthernet 1/0
Router(config-if)#ip address 80.10.245.23 255.255.255.0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Route
```

## Configuramos NAT dinamico

Vamos a pedir al router que traduzca todas las IPs de la red privada 192.168.0.0 al rango de IP publicas desde la 80.10.245.25 a la 80.10.245.30

``` cisco ios
Router(config)#access-list 10 permit 192.168.0.0 0.0.0.255
Router(config)#ip nat pool natpool1 80.10.245.25 80.10.245.30 netmask 255.255.255.0
Router(config)#ip nat inside source list 10 pool natpool1

Router(config)#interface fastEthernet 0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#interface fastEthernet 1/0
Router(config-if)#ip nat outside
Router(config-if)#exit
```

## Comprobamos la configuración desde un PC

Ahora tenemos una red privada y una publica. Podemos ver que desde las máquinas con IP privada podemos hacer Ping a las máquinas con IP publica, pero no al reves.

Tambien podemos comprobar que al hacer un TraceRT a las direcciones 80.10.245.23 y 80.10.245.23 el paquete se reenvia a las 192.168.0.11 y 192.168.0.12 respectivamente.

## comprobaciones desde el rotuer

Desde el router podemos hacer las siguientes comprobaciones

Elimina las entradas dinámicas de correspondencias que están almacenadas actualmente en la tabla NAT.

``` cisco ios
Router#clear ip nat translation *
```

Muestra la tabla de correspondencias entre direcciones privadas y públicas que están activas actualmente.

``` cisco ios
Router#show ip nat translation
```

Muestra inforamación estadística sobre la traducción de direcciones NAT

``` cisco ios
Router#show ip nat statistics
```

Activar la visualización de los eventos que produce el protocolo NAT

``` cisco ios
Router#debug ip nat
```
